<script>
	import { BlogBox } from '$lib/elements/blogBox';
	import { Button } from '$lib/elements/button';
	import { ArrowIcon } from '$lib/shared/icons';
</script>

<div class="page-privacy">
	<BlogBox>
		<h2 slot="title">
			<Button title="Назад" nav vibro dark circle on:click={() => history.back()}>
				<ArrowIcon left />
			</Button>
			Политика конфиденциальности
		</h2>
		<span slot="subtitle">На нашем сайте мы бережнo относимся к вашей конфиденциальности и гарантируем, что все персональные данные, которые мы собираем, будут использоваться исключительно в рамках настоящей политики конфиденциальности.</span>
		<section slot="content">
			<p>
				<h3>• Сбор персональных данных</h3>
				<p>Мы собираем только один вид персональных данных – адрес электронной почты e-mail. Это необходимо для того, чтобы обеспечить авторизацию пользователя на нашем сайте.</p>
				<br>
				<h3>• Использование персональных данных</h3>
				<p>Адрес электронной почты будет использоваться исключительно для целей авторизации пользователя на нашем сайте. Мы не будем использовать его для отправки маркетинговой почты или для любых других целей без вашего согласия.</p>
				<br>
				<h3>• Передача персональных данных третьим лицам</h3>
				<p>Мы никогда не передаём никаких персональных данных третьим лицам. Вы можете быть уверенными, что ваша информация остаётся в безопасности.</p>
				<br>
				<h3>• Защита персональных данных</h3>
				<p>Хотя мы не собираем какую-либо особенно чувствительную информацию, такую как номера кредитных карт или пароли, мы всё же принимаем меры безопасности для защиты адресов электронной почты, которые мы собираем. Только администратор сайта имеет доступ к этой информации.</p>
				<br>
				<h3>• Удаление персональных данных</h3>
				<p>Если вы хотите удалить свой аккаунт вместе со всей связанной с ним информацией, пожалуйста, обратитесь в нашу поддержку путем отправки запроса на удаление по адресу электронной почты, указанному на нашем сайте. После подтверждения вашей личности или прежней принадлежности к удаляемому аккаунту, мы удалим ваш аккаунт в течение разумного периода времени.</p>
				<br>
				<h3>• Куки</h3>
				<p>Мы не используем cookie-файлы на нашем сайте.</p>
				<br>
				<h3>• Контакты</h3>
				<p>Для любых вопросов или претензий по поводу обработки личных данных вашего аккаунта, звоните или отправляйте сообщение на наш e-mail, указанный на нашем сайте. Мы готовы помочь вам и ответить на ваши вопросы.</p>
		</section>
		<footer slot="footer">
			<a href="mailto:tojefin@gmail.com" target="_blank">
				<Button contrast>
					Связаться <ArrowIcon />
				</Button>
			</a>
		</footer>
	</BlogBox>
</div>

<style lang="scss">
	.page-privacy {
		display: flex;
		flex-direction: column;
		align-items: center;
		flex: 1 0 0;
		width: 100%;
	}
</style>
