<script>
	import { Button } from '$lib/elements/button';
	import { ModalBox } from '$lib/elements/mobalBox';
	import { ArrowIcon } from '$lib/shared/icons';

	export let isShow;
</script>

<ModalBox bind:isShow>
	<h2 slot="title">Правообладателям</h2>
	<span slot="subtitle">Отказ от ответственности за найденый материал</span>
	<section slot="content">
		<h3>Отказ от ответственности относительно соблюдения законов об авторском праве:</h3>
		<p>
			Касательно использования данного сайта, мы хотим подчеркнуть, что он предназначен только для
			целей развлeчения и предоставляет пользователям информацию о доступных на других ресурсах
			Интернета фильмах и сериалах. Наш сайт использует iframe с ссылками на другие источники в
			открытом доступе, но не размещает ни копии, ни зеркала контента с нарушенными правами на нашем
			сервере или каким-либо образом способствует их распространению. Контент, доступный через
			iframe, находится в юрисдикции владельцев этих ресурсов, а не на нашем сайте.
			<br />
			<br />
			Мы не принимаем ответственность за использование материалов, доступных через iframe на сторонних
			ресурсах. Выполняя действия по просмотру контента через iframe, вы полностью осознаёте риск и несёт
			полную ответственность за свои действия.
			<br /><br />
			В случае, если вы являетесь правообладателем и считаете, что ваши права были нарушены, просим вас
			связаться с нами непосредственно, чтобы мы могли принять соответствующие меры. Для этого вам необходимо
			предоставить нам письменное уведомление, которое должно включать следующее:
			<br /><br />
			• Ваше полное имя, адрес, телефонный номер и электронная почта;
			<br />
			• Точное описание материалов, которые, по вашему мнению, находятся в нарушении;
			<br />
			• URLs или другая достаточная информация, позволяющая нам локализовать конкретно этот контент;
			<br />
			• Доказательство того, что вы являетесь правообладателем данного материала или авторизованным представителем
			правообладателя;
			<br />
			• Подтверждение того, что указанная информация в вашем уведомлении верна, и что вы несете ответственность
			за то, что все указанные выше материалы будут считаться нарушающими закон.
			<br /><br />

			Спасибо за ваше внимание к соблюдению законов об авторском праве.
		</p>
	</section>
	<footer slot="footer">
		<a href="mailto:tojefin@gmail.com" target="_blank">
			<Button contrast>
				Связаться <ArrowIcon />
			</Button>
		</a>
	</footer>
</ModalBox>
