<script>
	import { BlogBox } from '$lib/elements/blogBox';
	import { Button } from '$lib/elements/button';
	import { ArrowIcon } from '$lib/shared/icons';
</script>

<div class="page-tos">
	<BlogBox>
		<h2 slot="title">
			<Button title="Назад" nav vibro dark circle on:click={() => history.back()}>
				<ArrowIcon left />
			</Button>
			Условия использования (ToS)
		</h2>
		<span slot="subtitle">Последнее обновление: 14.08.2024</span>
		<section slot="content">
			<p>
				<h3>1. Общие положения</h3>
				<p>Добро пожаловать на сайт kinofree.su, предоставляющий сервис поиска фильмов (далее "Сайт"). Используя наш Сайт, вы соглашаетесь с настоящими Условиями использования (далее "Условия"). Если вы не согласны с этими Условиями, пожалуйста, прекратите использование Сайта.</p>
				<br>
				<h3>2. Возрастное ограничение</h3>
				<p>Наш Сайт предназначен исключительно для пользователей, достигших 18 лет. Используя наш Сайт, вы подтверждаете, что вам не менее 18 лет.</p>
				<br>
				<h3>3. Учетные записи пользователей</h3>
				<p>Регистрация на Сайте не является обязательной для использования основных функций поиска фильмов. Однако, зарегистрированные пользователи получают возможность создавать и управлять своими коллекциями фильмов.</p>
				<br>
				<h4>3.1. Регистрация</h4>
				<p>При регистрации на Сайте вам необходимо предоставить актуальный адрес электронной почты. Вы несете ответственность за сохранность ваших учетных данных и должны немедленно уведомить администрацию Сайта о любом несанкционированном доступе к вашей учетной записи.</p>
				<br>
				<h4>3.2. Удаление учетной записи</h4>
				<p>Вы можете обратиться к Администрации для удаления своей учётной записи. Администрация оставляет за собой право приостанавливать или удалять учетные записи, нарушающие настоящие Условия.</p>
				<br>
				<h3>4. Ответственность за контент</h3>
				<p>Сайт не несет ответственности за ошибки, нарушение авторских прав и актуальность информации о фильмах на Сайте. Вся информация предоставляется на основе сторонних источников и может быть неполной или неточной.</p>
				<br>
				<h3>5. Изменения в Условиях</h3>
				<p>Администрация Сайта оставляет за собой право изменять данные Условия в любое время без предварительного уведомления пользователей. Продолжая использование Сайта после внесения изменений, вы соглашаетесь с новыми условиями.</p>
				<br>
				<h3>6. Политика конфиденциальности</h3>
				<p>Обработка и защита ваших персональных данных регулируется нашей Политикой конфиденциальности, которая доступна по следующей ссылке: <a href="/legal/privacy">kinofree.su/legal/privacy</a>.</p>
				<br>
				<h3>7. Связь с администрацией</h3>
				<p>Если у вас возникли вопросы или претензии, вы можете связаться с администрацией Сайта по электронной почте: tojefin@gmail.com.</p>
				<br>
				<h3>8. Применимое законодательство</h3>
				<p>Настоящие Условия регулируются и толкуются в соответствии с применимым законодательством страны проживания пользователя.</p>
		</section>
		<footer slot="footer">
			<a href="mailto:tojefin@gmail.com" target="_blank">
				<Button contrast>
					Связаться <ArrowIcon />
				</Button>
			</a>
		</footer>
	</BlogBox>
</div>

<style lang="scss">
	.page-tos {
		display: flex;
		flex-direction: column;
		align-items: center;
		flex: 1 0 0;
		width: 100%;
	}
</style>
